app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Science"], ["room_number", 100]]
---
    def create
        @school_class = SchoolClass.new(class_params(:title, :room_number))
        @school_class.save